UT_Marketplaces.Marketplaces/src/InformationRegisters/рар_мп_Ozon_СопоставленныеТовары/рар_мп_Ozon_СопоставленныеТовары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>рар_мп_Ozon_СопоставленныеТовары</name>
  <resources>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </resources>
  <resources>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </resources>
  <resources>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </resources>
  <attributes>
    <name>НаименованиеТовара</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Аккаунт</name>
    <type>
      <types>CatalogRef.рар_мп_АккаунтыМаркетплейсов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>IDТовара</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>30</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>SKUТовара</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

UT_Marketplaces.Marketplaces/src/InformationRegisters/рар_мп_ЯндексМаркет_СопоставленныеТовары/рар_мп_ЯндексМаркет_СопоставленныеТовары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>рар_мп_ЯндексМаркет_СопоставленныеТовары</name>
  <resources>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </resources>
  <resources>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </resources>
  <resources>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </resources>
  <attributes>
    <name>НаименованиеТовара</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SKUЯндексМаркета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Аккаунт</name>
    <type>
      <types>CatalogRef.рар_мп_АккаунтыМаркетплейсов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>SKUТовара</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

UT_Marketplaces.Marketplaces/src/InformationRegisters/рар_мп_Wildberries_СопоставленныеТовары/рар_мп_Wildberries_СопоставленныеТовары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>рар_мп_Wildberries_СопоставленныеТовары</name>
  <resources>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </resources>
  <resources>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </resources>
  <resources>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </resources>
  <attributes>
    <name>Размер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеТовара</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IDРазмера</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>30</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВозможностьСменыЦенДляРазмеров</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Аккаунт</name>
    <type>
      <types>CatalogRef.рар_мп_АккаунтыМаркетплейсов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>IDТовара</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>30</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Баракод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

UT_Marketplaces.Marketplaces/src/InformationRegisters/ШтрихкодыНоменклатуры/ШтрихкодыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="fe779ac1-0e7f-489c-ad06-bec9af582428">
  <name>ШтрихкодыНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="d561ee5a-2a87-4205-93af-4902b1247d87">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="93716140-4123-4913-8258-75356dec29a0">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="c79450ab-f8f1-43d9-948d-10c6481c5538">
    <name>Упаковка</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="75e2d606-c8d4-4cfe-8f96-2eaa5c364409">
    <name>Штрихкод</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
</mdclass:InformationRegister>

UT_Marketplaces.Marketplaces/src/Enums/рар_мп_Маркетплейсы/рар_мп_Маркетплейсы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>рар_мп_Маркетплейсы</name>
  <enumValues>
    <name>OZON</name>
  </enumValues>
  <enumValues>
    <name>ЯндексМаркет</name>
  </enumValues>
  <enumValues>
    <name>Wildberries</name>
  </enumValues>
</mdclass:Enum>

UT_Marketplaces.Marketplaces/src/CommonModules/рар_мп_СопоставлениеТоваров/Module.bsl
#Область Ozon

Функция ПолучитьСписокТоваровКСопоставлению_Ozon(Аккаунт) Экспорт

	ИдентификаторСтраницы = "";
	
	ТабЗначТоваров = Новый ТаблицаЗначений;
	ТабЗначТоваров.Колонки.Добавить("IDТовара");
	ТабЗначТоваров.Колонки.Добавить("Артикул");
	ТабЗначТоваров.Колонки.Добавить("Баракод");
	ТабЗначТоваров.Колонки.Добавить("НаименованиеТовара");
	ТабЗначТоваров.Колонки.Добавить("SKUТовара");
	
	HTTPОтвет = рар_мп_Ozon_Методы.Метод_СписокТоваров(Аккаунт, ИдентификаторСтраницы); 
	
	Если HTTPОтвет.Свойство("ОтветAPI") Тогда
		
		Если HTTPОтвет.КодСостояния <> 200 Тогда
			
			ТабЗначТоваров.Очистить();
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Ошибка при получении товаров из маркетплейса. Подробное описание ошибки можно посмотреть в журнале регистрации";
			Сообщение.Сообщить();
			
			Комментарий = СтрШаблон("Аккаунт: %3. Код запроса:%1. Описание ошибки:%2", HTTPОтвет.КодСостояния, HTTPОтвет.ОтветAPI.message, Аккаунт);
				
			ЗаписьЖурналаРегистрации("Ошибка при получении ", УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);

			Возврат	ТабЗначТоваров; 
				
		КонецЕсли;
		
		ИдентификаторСтраницы = HTTPОтвет.ОтветAPI.result.last_id; 
		КоличествоСтраниц = Цел(HTTPОтвет.ОтветAPI.result.total/1000);
		МассивТоваровИзЗапроса = HTTPОтвет.ОтветAPI.result.items;
		
		КоличествоЗапросов = 0;
		
		Пока КоличествоСтраниц > 0 Цикл
			
			Если КоличествоЗапросов = 50 Тогда
				
				КоличествоЗапросов = 0;
				
				ВремяОжидания = 5;
				
				ВремяСледующегоЗапроса = ТекущаяДата() + ВремяОжидания;
				
				Пока ТекущаяДата() < ВремяСледующегоЗапроса Цикл
					// Ожидаем время для следующего запроса	
				КонецЦикла;
				
			КонецЕсли;
			
			HTTPОтвет = рар_мп_Ozon_Методы.Метод_СписокТоваров(Аккаунт, ИдентификаторСтраницы);
			
			КоличествоЗапросов = КоличествоЗапросов + 1;
			
			Если HTTPОтвет.Свойство("ОтветAPI") Тогда
				
				Если HTTPОтвет.КодСостояния <> 200 Тогда
					
					ТабЗначТоваров.Очистить();
				
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = "Ошибка при получении товаров из маркетплейса. Подробное описание ошибки можно посмотреть в журнале регистрации";
					Сообщение.Сообщить();
					
					Комментарий = СтрШаблон("Аккаунт: %3. Код запроса:%1. Описание ошибки:%2", HTTPОтвет.КодСостояния, HTTPОтвет.ОтветAPI.message, Аккаунт);
						
					ЗаписьЖурналаРегистрации("Ошибка при получении ", УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);

					Возврат ТабЗначТоваров;
						
				КонецЕсли;
				
				ИдентификаторСтраницы = HTTPОтвет.ОтветAPI.result.last_id;
				ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивТоваровИзЗапроса, HTTPОтвет.ОтветAPI.result.items, Истина);		
				КоличествоСтраниц = КоличествоСтраниц - 1; 
				
			Иначе
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Ошибка при получении данных о товарах. Подробное описание ошибки можно посмотреть в журнале регистрации";
				Сообщение.Сообщить();
				
				Комментарий = "Ошибка при получении JSON. Некорректные значения JSON";
				
				ЗаписьЖурналаРегистрации("Ошибка при получении данных о товарах", УровеньЖурналаРегистрации.Ошибка,,,СтрШаблон("Аккаунт: %3. Код запроса:%1. Описание ошибки:%2", HTTPОтвет.КодСостояния, Комментарий, Аккаунт),);
			
			КонецЕсли;
			
		КонецЦикла;
		
		ПакетыТоваров = РазделениеМассиваНаПакеты(МассивТоваровИзЗапроса, 1000);
		
		Для Каждого Пакет Из ПакетыТоваров Цикл
			
			Если КоличествоЗапросов = 50 Тогда
				
				КоличествоЗапросов = 0;
				
				ВремяОжидания = 5;
				
				ВремяСледующегоЗапроса = ТекущаяДата() + ВремяОжидания;
				
				Пока ТекущаяДата() < ВремяСледующегоЗапроса Цикл
					// Ожидаем время для следующего запроса	
				КонецЦикла;
				
			КонецЕсли;
		
			HTTPОтвет = рар_мп_Ozon_Методы.Метод_ПолучитьОписаниеХарактеристикТовара(Аккаунт, Пакет.Значение);
			
			КоличествоЗапросов = КоличествоЗапросов + 1;
			
			Если HTTPОтвет.Свойство("ОтветAPI") Тогда
				
				Если HTTPОтвет.КодСостояния <> 200 Тогда
					
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = СтрШаблон("Ошибка при получении информации о товарах. 
												|Подробное описание ошибки можно посмотреть в журнале регистрации");
					Сообщение.Сообщить();
					
					Комментарий = СтрШаблон("Аккаунт: %3. Код запроса:%1. Описание ошибки:%2", HTTPОтвет.КодСостояния, HTTPОтвет.ОтветAPI.message, Аккаунт);
					
					ЗаписьЖурналаРегистрации("Ошибка при получении информации о товарах", УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);
					
				Иначе
					
					Для Каждого Товар Из HTTPОтвет.ОтветAPI.items Цикл
						
						Попытка
							
							IDТовара		   = Формат(Товар.id,"ЧГ=");
							Артикул  		   = Формат(Товар.offer_id,"ЧГ=");
							НаименованиеТовара = Товар.name;
							SKU				   = "";
							Если Товар.sources.Количество() <> 0 Тогда
								SKU = Товар.sources[0].sku;
							КонецЕсли;
							Баракод = "";
							Если Товар.Свойство("barcodes") Тогда
								Если Товар.barcodes.Количество() <> 0 Тогда
									Баракод = Товар.barcodes.Получить(0);
								КонецЕсли;
							КонецЕсли;
							
							Запись 				= РегистрыСведений.рар_мп_Ozon_СопоставленныеТовары.СоздатьМенеджерЗаписи();
							Запись.Аккаунт  	= Аккаунт;
							Запись.IDТовара 	= IDТовара;
							Запись.Артикул  	= Артикул;
							Запись.SKUТовара 	= SKU;
							
							Запись.Прочитать();
							
							Если Не Запись.Выбран() Тогда
								
								НоваяСтрока = ТабЗначТоваров.Добавить();
								
								НоваяСтрока.IDТовара  	  		= IDТовара;
								НоваяСтрока.Артикул		 	  	= Артикул;
								НоваяСтрока.Баракод				= Баракод;
								НоваяСтрока.НаименованиеТовара	= НаименованиеТовара;
								НоваяСтрока.SKUТовара			= SKU;
								
							КонецЕсли;
							
						Исключение
							
							Сообщение = Новый СообщениеПользователю;
							Сообщение.Текст = СтрШаблон("Ошибка при получении информации о товаре с id: %1. 
														|Подробное описание ошибки можно посмотреть в журнале регистрации",
														Товар.id);
							Сообщение.Сообщить();
							
							Комментарий = СтрШаблон("Аккаунт: %3. Код запроса:%1. Описание ошибки:%2", HTTPОтвет.КодСостояния, ОписаниеОшибки(), Аккаунт);
							
							ЗаписьЖурналаРегистрации(СтрШаблон("Ошибка при получении информации о товаре с id: %1", Товар.id), 
														УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);
							
						КонецПопытки;
						
					КонецЦикла;
					
				КонецЕсли;		
				
			Иначе
				
				ТабЗначТоваров.Очистить();
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Ошибка при получении данных о товарах. Подробное описание ошибки можно посмотреть в журнале регистрации";
				Сообщение.Сообщить();
				
				Комментарий = "Ошибка при получении JSON. Некорректные значения JSON";
				
				ЗаписьЖурналаРегистрации("Ошибка при получении данных о товарах", УровеньЖурналаРегистрации.Ошибка,,,
											СтрШаблон("Аккаунт: %3. Код запроса:%1. Описание ошибки:%2", HTTPОтвет.КодСостояния, Комментарий, Аккаунт),);
				
				Возврат ТабЗначТоваров;
				
			КонецЕсли;
			
		КонецЦикла;
		
	Иначе
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Ошибка при получении данных о товарах. Подробное описание ошибки можно посмотреть в журнале регистрации";
		Сообщение.Сообщить();
		
		Комментарий = "Ошибка при получении JSON. Некорректные значения JSON";
		
		ЗаписьЖурналаРегистрации("Ошибка при получении данных о товарах", УровеньЖурналаРегистрации.Ошибка,,,СтрШаблон("Аккаунт: %3. Код запроса:%1. Описание ошибки:%2", HTTPОтвет.КодСостояния, Комментарий, Аккаунт),);
		
		Возврат ТабЗначТоваров;
		
	КонецЕсли;
	
	Возврат ТабЗначТоваров;

КонецФункции

Функция РазделениеМассиваНаПакеты(ИсходныйМассив, РазмерПакета)
	
	// Создаем структуру для хранения пакетов
	Пакеты = Новый Структура;
	
	// Параметры для разделения
	КоличествоПакетов = Цел(ИсходныйМассив.Количество() / РазмерПакета);
	Если ИсходныйМассив.Количество() % РазмерПакета > 0 Тогда
		КоличествоПакетов = КоличествоПакетов + 1;
	КонецЕсли;
	
	// Разделяем массив на пакеты
	Для НомерПакета = 1 По КоличествоПакетов Цикл
		НовыйПакет = Новый Массив;
		НачальныйИндекс = (НомерПакета - 1) * РазмерПакета;
		КонечныйИндекс = Мин(НачальныйИндекс + РазмерПакета - 1, ИсходныйМассив.Количество() - 1);
		
		Для Индекс = НачальныйИндекс По КонечныйИндекс Цикл
			НовыйПакет.Добавить(ИсходныйМассив[Индекс]);
		КонецЦикла;
		
		// Добавляем пакет в структуру с ключом "ПакетN"
		Пакеты.Вставить("Пакет" + Формат(НомерПакета, "ЧГ=0"), НовыйПакет);
	КонецЦикла;
	
	Возврат Пакеты;
	
КонецФункции

#КонецОбласти

#Область ЯндексМаркет

Функция ПолучитьСписокТоваровКСопоставлению_ЯндексМаркет(Аккаунт) Экспорт
	
	ПослядняяСтраница = Ложь;
	СледующаяСтраница = "";
	Архив = Ложь;
	
	ТабЗначТоваров = Новый ТаблицаЗначений;
	ТабЗначТоваров.Колонки.Добавить("SKUТовара");
	ТабЗначТоваров.Колонки.Добавить("SKUЯндексМаркета");
	ТабЗначТоваров.Колонки.Добавить("НаименованиеТовара");
	ТабЗначТоваров.Колонки.Добавить("Артикул");
	ТабЗначТоваров.Колонки.Добавить("Баракод");
		
	Пока НЕ ПослядняяСтраница Цикл
	
		HTTPОтвет = рар_мп_ЯндексМаркет_Методы.Метод_ИнформацияОТоварахВКаталогах(Аккаунт, СледующаяСтраница, Архив);
		
		Если HTTPОтвет.Свойство("ОтветAPI") Тогда
			
			Если HTTPОтвет.КодСостояния <> 200 Тогда
				
				ТабЗначТоваров.Очистить();
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Ошибка при получении товаров к сопоставлению. 
								   |Подробное описание ошибки можно посмотреть в журнале регистрации";
				Сообщение.Сообщить();
				
				Комментарий = СтрШаблон("Аккаунт: %3. Код запроса:%1. Описание ошибки:%2", HTTPОтвет.КодСостояния, HTTPОтвет.ОтветAPI.errors.Получить(0).message, Аккаунт);
				
				ЗаписьЖурналаРегистрации("Ошибка при получении товаров к сопоставлению", 
										 УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);
				
				Возврат ТабЗначТоваров; 	
				
			Иначе
				
				Попытка
			
					Для каждого Строка Из HTTPОтвет.ОтветAPI.result.offerMappings Цикл
						
						Запись 			 = РегистрыСведений.рар_мп_ЯндексМаркет_СопоставленныеТовары.СоздатьМенеджерЗаписи();
						Запись.Аккаунт   = Аккаунт;
						Запись.SKUТовара = Строка.offer.offerId;
						Запись.Артикул   = ?(Строка.offer.Свойство("vendorCode"), Строка.offer.vendorCode, "");
						
						Запись.Прочитать();

						Если НЕ Запись.Выбран() Тогда
			
							СтрокаТЗ		     	  	= ТабЗначТоваров.Добавить(); 
							СтрокаТЗ.SKUТовара 	 		= Строка.offer.offerId;
							СтрокаТЗ.Артикул 	 	  	= ?(Строка.offer.Свойство("vendorCode"), Строка.offer.vendorCode, "");
							СтрокаТЗ.НаименованиеТовара	= Строка.offer.name;
							
							Если Строка.Свойство("mapping") Тогда
								Если Строка.mapping.Свойство("marketSku") Тогда
									СтрокаТЗ.SKUЯндексМаркета = СтрЗаменить(Строка(Строка.mapping.marketSku), Символы.НПП, "");
								КонецЕсли;
							КонецЕсли;
							
							Если Строка.offer.Свойство("barcodes") Тогда
								Если Строка.offer.barcodes.Количество() > 0 Тогда
									СтрокаТЗ.Баракод = Строка.offer.barcodes.Получить(0);
								КонецЕсли;
							КонецЕсли;
							
						КонецЕсли;	
						
					КонецЦикла;
					
					Если HTTPОтвет.ОтветAPI.result.paging.Свойство("nextPageToken") Тогда
						СледующаяСтраница = HTTPОтвет.ОтветAPI.result.paging.nextPageToken;			
					Иначе
						
						Если Архив = Ложь Тогда
							
							Архив = Истина;
							СледующаяСтраница = "";
							
						Иначе
							
							ПослядняяСтраница = Истина;
							
						КонецЕсли;
						
					КонецЕсли;	
				
				Исключение
					
					ТабЗначТоваров.Очистить();
					
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = "Ошибка при получении товаров к сопоставлению. Подробное описание ошибки можно посмотреть в журнале регистрации";
					Сообщение.Сообщить();
					
					Комментарий = СтрШаблон("Аккаунт: %3. Код запроса:%1. Описание ошибки:%2", HTTPОтвет.КодСостояния, ОписаниеОшибки(), Аккаунт);
					
					ЗаписьЖурналаРегистрации("Ошибка при получении товаров к сопоставлению", 
											 УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);
					
					Возврат ТабЗначТоваров;
				
				КонецПопытки;	
				
			КонецЕсли;
			
		Иначе
			
			ТабЗначТоваров.Очистить();
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Ошибка при получении данных о товарах. Подробное описание ошибки можно посмотреть в журнале регистрации";
			Сообщение.Сообщить();
			
			Комментарий = "Ошибка при получении JSON. Некорректные значения JSON";
			
			ЗаписьЖурналаРегистрации("Ошибка при получении данных о товарах", УровеньЖурналаРегистрации.Ошибка,,,СтрШаблон("Аккаунт: %3. Код запроса:%1. Описание ошибки:%2", HTTPОтвет.КодСостояния, Комментарий, Аккаунт),);
			
			Возврат ТабЗначТоваров;
			
		КонецЕсли;
		
	КонецЦикла; 
	
	Возврат ТабЗначТоваров;
	
КонецФункции

#КонецОбласти

#Область Wildberries

Функция ПолучитьСписокТоваровКСопоставлению_Wildberries(Аккаунт) Экспорт	

	ТабЗначТоваров = Новый ТаблицаЗначений;
	ТабЗначТоваров.Колонки.Добавить("IDТовара");
	ТабЗначТоваров.Колонки.Добавить("Артикул");
	ТабЗначТоваров.Колонки.Добавить("Баракод");
	ТабЗначТоваров.Колонки.Добавить("НаименованиеТовара");
	ТабЗначТоваров.Колонки.Добавить("Размер");
	ТабЗначТоваров.Колонки.Добавить("IDРазмера");
	ТабЗначТоваров.Колонки.Добавить("ВозможностьСменыЦенДляРазмеров");
	
	КоличествоНоменклатуры = 100;
	ОграничениеНаСтранице  = 100;
	ДатаИзменения 		   = ""; 
	НомерСтраницы 		   = "";
	
	Пока КоличествоНоменклатуры >= ОграничениеНаСтранице Цикл
	
		HTTPОтвет = рар_мп_Wildberries_Методы.Метод_СписокКарточекТоваров(Аккаунт, ДатаИзменения, НомерСтраницы);
		
		Если HTTPОтвет.Свойство("ОтветAPI") Тогда
			
			Если HTTPОтвет.КодСостояния <> 200 Тогда
				
				ТабЗначТоваров.Очистить();
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Ошибка при получении товаров к сопоставлению. 
								   |Подробное описание ошибки можно посмотреть в журнале регистрации";
				Сообщение.Сообщить();
				
				Если HTTPОтвет.ОтветAPI.Свойство("errorText") Тогда
			
					ОписаниеОшибки = HTTPОтвет.ОтветAPI.errorText;	
				
				Иначе
				
					ОписаниеОшибки = HTTPОтвет.ОтветAPI.detail;	
				
				КонецЕсли; 
				
				Комментарий = СтрШаблон("Аккаунт: %3. Код запроса:%1. Описание ошибки:%2", HTTPОтвет.КодСостояния, ОписаниеОшибки, Аккаунт);
				
				ЗаписьЖурналаРегистрации("Ошибка при получении товаров к сопоставлению", 
										 УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);
				
				Возврат ТабЗначТоваров; 	
				
			Иначе
				
				Попытка
				
					ДатаИзменения = HTTPОтвет.ОтветAPI.cursor.updatedAt;
					
					НомерСтраницы = HTTPОтвет.ОтветAPI.cursor.nmID;
					
					КоличествоНоменклатуры = HTTPОтвет.ОтветAPI.cursor.total;
					
					Для каждого Строка Из HTTPОтвет.ОтветAPI.cards Цикл
						
						Для каждого Размер Из Строка.sizes Цикл
						
							Запись 			 = РегистрыСведений.рар_мп_Wildberries_СопоставленныеТовары.СоздатьМенеджерЗаписи();
							Запись.Аккаунт   = Аккаунт;
							Запись.IDТовара  = Формат(Строка.nmID, "ЧГ=");
							Запись.Артикул   = Строка.vendorCode;
							
							Если Размер.skus.Количество() > 0 Тогда
								Запись.Баракод = Размер.skus.Получить(0);	
							КонецЕсли;
							
							Запись.Размер	 = Размер.techSize;
							Запись.IDРазмера = Размер.chrtID;
							
							Запись.Прочитать();

							Если НЕ Запись.Выбран() Тогда
				
								СтрокаТЗ		     	  	= ТабЗначТоваров.Добавить(); 
								СтрокаТЗ.IDТовара 	 		= Формат(Строка.nmID, "ЧГ=");
								СтрокаТЗ.Артикул 	 	  	= Строка.vendorCode; 
								
								Если Размер.skus.Количество() > 0 Тогда
									СтрокаТЗ.Баракод = Размер.skus.Получить(0);
								КонецЕсли;
							
								СтрокаТЗ.Размер				= Размер.techSize;
								СтрокаТЗ.НаименованиеТовара	= Строка.title;
								СтрокаТЗ.IDРазмера			= Размер.chrtID;
									
							КонецЕсли;	
						
						КонецЦикла;		
					
					КонецЦикла;
				
				Исключение
					
					ТабЗначТоваров.Очистить();
					
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = "Ошибка при получении товаров к сопоставлению. 
									   |Подробное описание ошибки можно посмотреть в журнале регистрации";
					Сообщение.Сообщить();
					
					Комментарий = СтрШаблон("Аккаунт: %3. Код запроса:%1. Описание ошибки:%2", HTTPОтвет.КодСостояния, ОписаниеОшибки(), Аккаунт);
					
					ЗаписьЖурналаРегистрации("Ошибка при получении товаров к сопоставлению", 
											 УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);
					
					Возврат ТабЗначТоваров;
				
				КонецПопытки;
				
			КонецЕсли;
			
		Иначе
			
			ТабЗначТоваров.Очистить();
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Ошибка при получении данных о товарах. Подробное описание ошибки можно посмотреть в журнале регистрации";
			Сообщение.Сообщить();
			
			Комментарий = "Ошибка при получении JSON. Некорректные значения JSON";
			
			ЗаписьЖурналаРегистрации("Ошибка при получении данных о товарах", УровеньЖурналаРегистрации.Ошибка,,,СтрШаблон("Аккаунт: %3. Код запроса:%1. Описание ошибки:%2", HTTPОтвет.КодСостояния, Комментарий, Аккаунт),);
			
			Возврат ТабЗначТоваров;
			
		КонецЕсли;
	
	КонецЦикла;
	
	ПроверитьНаИзменениеЦен(Аккаунт, ТабЗначТоваров);
	
	Возврат ТабЗначТоваров;
	
КонецФункции

Процедура ПроверитьНаИзменениеЦен(Аккаунт, ТабЗначТоваров)
	
	Смещение = 0;
	
	HTTPОтвет = рар_мп_Wildberries_Методы.Метод_ПолучитьТоварыСЦенами(Аккаунт, Смещение);
	
	КоличествоЗапросов = 1;
	
	Если HTTPОтвет.Свойство("ОтветAPI") Тогда
		
		Если HTTPОтвет.КодСостояния <> 200 Тогда
			
			ТабЗначТоваров.Очистить();
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Ошибка при получении товаров к сопоставлению. 
								|Подробное описание ошибки можно посмотреть в журнале регистрации";
			Сообщение.Сообщить();
			
			Если HTTPОтвет.ОтветAPI.Свойство("errorText") Тогда
				
				ОписаниеОшибки = HTTPОтвет.ОтветAPI.errorText;	
				
			Иначе
				
				ОписаниеОшибки = HTTPОтвет.ОтветAPI.detail;	
				
			КонецЕсли; 
			
			Комментарий = СтрШаблон("Аккаунт: %3. Код запроса:%1. Описание ошибки:%2", HTTPОтвет.КодСостояния, ОписаниеОшибки, Аккаунт);
			
			ЗаписьЖурналаРегистрации("Ошибка при получении товаров к сопоставлению", 
										УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);
			
			Возврат; 	
			
		Иначе
			
			Пока HTTPОтвет.ОтветAPI.data.listGoods.Количество() <> 0 Цикл
				
				Попытка
					
					Для Каждого Строка Из HTTPОтвет.ОтветAPI.data.listGoods Цикл
						
						НайденныеСтрокиНоменклатуры = ТабЗначТоваров.НайтиСтроки(Новый Структура("Артикул", Строка.vendorCode));
						
						Если НайденныеСтрокиНоменклатуры.Количество() > 0 Тогда
							
							Для Каждого НайденнаяСтрока Из НайденныеСтрокиНоменклатуры Цикл
								
								НайденнаяСтрока.ВозможностьСменыЦенДляРазмеров = Строка.editableSizePrice;
								
							КонецЦикла;
						
						КонецЕсли;
						
					КонецЦикла;
					
				Исключение
					
					ТабЗначТоваров.Очистить();
					
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = "Ошибка при получении товаров к сопоставлению. 
									   |Подробное описание ошибки можно посмотреть в журнале регистрации";
					Сообщение.Сообщить();
					
					Комментарий = СтрШаблон("Аккаунт: %3. Код запроса:%1. Описание ошибки:%2", HTTPОтвет.КодСостояния, ОписаниеОшибки(), Аккаунт);
					
					ЗаписьЖурналаРегистрации("Ошибка при получении товаров к сопоставлению", 
											 УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);
					
					Возврат;
					
				КонецПопытки;
				
				Смещение = Смещение + 1000;
				
				Если КоличествоЗапросов = 10 Тогда
					
					ВремяОжидания = 6;
					
					ВремяСледующегоЗапроса = ТекущаяДата() + ВремяОжидания;
					
					Пока ТекущаяДата() < ВремяСледующегоЗапроса Цикл
						// Ожидаем время для следующего запроса	
					КонецЦикла;
					
					КоличествоЗапросов = 0;
					
				КонецЕсли;
				
				HTTPОтвет = рар_мп_Wildberries_Методы.Метод_ПолучитьТоварыСЦенами(Аккаунт, Строка(Смещение));
				
				КоличествоЗапросов = КоличествоЗапросов + 1;
				
				Если HTTPОтвет.Свойство("ОтветAPI") Тогда
					
					Если HTTPОтвет.КодСостояния <> 200 Тогда
						
						ТабЗначТоваров.Очистить();
						
						Сообщение = Новый СообщениеПользователю;
						Сообщение.Текст = "Ошибка при получении товаров к сопоставлению. 
											|Подробное описание ошибки можно посмотреть в журнале регистрации";
						Сообщение.Сообщить();
						
						Если HTTPОтвет.ОтветAPI.Свойство("errorText") Тогда
							
							ОписаниеОшибки = HTTPОтвет.ОтветAPI.errorText;	
							
						Иначе
							
							ОписаниеОшибки = HTTPОтвет.ОтветAPI.detail;	
							
						КонецЕсли; 
						
						Комментарий = СтрШаблон("Аккаунт: %3. Код запроса:%1. Описание ошибки:%2", HTTPОтвет.КодСостояния, ОписаниеОшибки, Аккаунт);
						
						ЗаписьЖурналаРегистрации("Ошибка при получении товаров к сопоставлению", 
													УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);
						
						Возврат;
						
					КонецЕсли;
					
				Иначе
					
					ТабЗначТоваров.Очистить();
					
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = "Ошибка при получении данных о товарах. Подробное описание ошибки можно посмотреть в журнале регистрации";
					Сообщение.Сообщить();
					
					Комментарий = "Ошибка при получении JSON. Некорректные значения JSON";
					
					ЗаписьЖурналаРегистрации("Ошибка при получении данных о товарах", УровеньЖурналаРегистрации.Ошибка,,,СтрШаблон("Аккаунт: %3. Код запроса:%1. Описание ошибки:%2", HTTPОтвет.КодСостояния, Комментарий, Аккаунт),);
					
					Возврат;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	Иначе
		
		ТабЗначТоваров.Очистить();
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Ошибка при получении данных о товарах. Подробное описание ошибки можно посмотреть в журнале регистрации";
		Сообщение.Сообщить();
		
		Комментарий = "Ошибка при получении JSON. Некорректные значения JSON";
		
		ЗаписьЖурналаРегистрации("Ошибка при получении данных о товарах", УровеньЖурналаРегистрации.Ошибка,,,СтрШаблон("Аккаунт: %3. Код запроса:%1. Описание ошибки:%2", HTTPОтвет.КодСостояния, Комментарий, Аккаунт),);
		
		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СохранениеСопоставления

Функция СохранениеСопоставления(ТоварыКСопоставлению, АккаунтМаркетплейса) Экспорт

	ВыбранныеСтроки = ТоварыКСопоставлению.НайтиСтроки(Новый Структура("ИзменитьПозицию", Истина));
	
	Если ВыбранныеСтроки.Количество() = 0 Тогда
	
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не выбрано ни одной строки для сохранения сопоставления складов";
		Сообщение.Сообщить();
		
	Иначе
			
		Для каждого Стр Из ВыбранныеСтроки Цикл
		
			Если ЗначениеЗаполнено(Стр.Номенклатура) Тогда
				
				Маркетплейс = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(АккаунтМаркетплейса, "Маркетплейс");
			
				Если Маркетплейс = Перечисления.рар_мп_Маркетплейсы.Wildberries Тогда
				
					МенеджерЗаписи 					  = РегистрыСведений.рар_мп_Wildberries_СопоставленныеТовары.СоздатьМенеджерЗаписи();
					МенеджерЗаписи.Аккаунт			  = АккаунтМаркетплейса; 
					МенеджерЗаписи.IDТовара			  = Стр.IDТовара;
					МенеджерЗаписи.Артикул			  = Стр.Артикул;
					МенеджерЗаписи.Баракод			  = Стр.Баракод;
					МенеджерЗаписи.Размер 			  = Стр.Размер;
					МенеджерЗаписи.Номенклатура		  = Стр.Номенклатура;
					МенеджерЗаписи.Характеристика 	  = Стр.Характеристика;
					
					Если ЗначениеЗаполнено(Стр.Упаковка) Тогда
					
						МенеджерЗаписи.Упаковка = Стр.Упаковка;	
					
					Иначе
					
						ЕдиницаИзмерения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Стр.Номенклатура, "ЕдиницаИзмерения");
						
						МенеджерЗаписи.Упаковка = ЕдиницаИзмерения;
					
					КонецЕсли;
					
					МенеджерЗаписи.НаименованиеТовара = Стр.НаименованиеТовара;
					
				ИначеЕсли Маркетплейс = Перечисления.рар_мп_Маркетплейсы.ЯндексМаркет  Тогда
					
					МенеджерЗаписи 					  = РегистрыСведений.рар_мп_ЯндексМаркет_СопоставленныеТовары.СоздатьМенеджерЗаписи();
					МенеджерЗаписи.Аккаунт 			  = АккаунтМаркетплейса; 
					МенеджерЗаписи.SKUТовара 		  = Стр.SKUТовара;
					МенеджерЗаписи.SKUЯндексМаркета   = Стр.SKUЯндексМаркета;
					МенеджерЗаписи.Артикул 			  = Стр.Артикул;
					МенеджерЗаписи.Номенклатура		  = Стр.Номенклатура;
					МенеджерЗаписи.Характеристика 	  = Стр.Характеристика;
					
					Если ЗначениеЗаполнено(Стр.Упаковка) Тогда
					
						МенеджерЗаписи.Упаковка = Стр.Упаковка;	
					
					Иначе
					
						ЕдиницаИзмерения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Стр.Номенклатура, "ЕдиницаИзмерения");
						
						МенеджерЗаписи.Упаковка = ЕдиницаИзмерения;
					
					КонецЕсли;
					
					МенеджерЗаписи.НаименованиеТовара = Стр.НаименованиеТовара;
					
				ИначеЕсли Маркетплейс = Перечисления.рар_мп_Маркетплейсы.OZON  Тогда
				
					МенеджерЗаписи 					  = РегистрыСведений.рар_мп_Ozon_СопоставленныеТовары.СоздатьМенеджерЗаписи();	
				    МенеджерЗаписи.Аккаунт			  = АккаунтМаркетплейса; 
					МенеджерЗаписи.IDТовара			  = Стр.IDТовара; 
					МенеджерЗаписи.SKUТовара 		  = Стр.SKUТовара;
					МенеджерЗаписи.Артикул			  = Стр.Артикул;
					МенеджерЗаписи.Номенклатура		  = Стр.Номенклатура;
					МенеджерЗаписи.Характеристика 	  = Стр.Характеристика;
					
					Если ЗначениеЗаполнено(Стр.Упаковка) Тогда
					
						МенеджерЗаписи.Упаковка = Стр.Упаковка;	
					
					Иначе
					
						ЕдиницаИзмерения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Стр.Номенклатура, "ЕдиницаИзмерения");
						
						МенеджерЗаписи.Упаковка = ЕдиницаИзмерения;
					
					КонецЕсли;
					
					МенеджерЗаписи.НаименованиеТовара = Стр.НаименованиеТовара;					
				КонецЕсли;
				
				Попытка
				
					МенеджерЗаписи.Записать();
					
					ТоварыКСопоставлению.Удалить(ТоварыКСопоставлению.Индекс(Стр));
				
				Исключение
					
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = СтрШаблон("Ошибка при сопоставлении товара с уникальным идентификатором: %1 и названием: %2. 
												|Продробную ошибку можно посмотреть в журнале регистрации", 
												Стр.IDТовара, Стр.НаименованиеТовара);
					Сообщение.Сообщить();
					
					ЗаписьЖурналаРегистрации(СтрШаблон("Ошибка при сопоставлении товара с уникальным идентификатором: %1 и названием: %2", 
														Стр.IDТовара, Стр.НаименованиеТовара), УровеньЖурналаРегистрации.Ошибка,,,ОписаниеОшибки(),);
				
				КонецПопытки;
				    			
			
			Иначе
			
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = СтрШаблон("Не удалось сохранить сопоставление так как не указано значение в поле 'Номенклатура' для товара 
											|с уникальным идентификатором: %1 и названием: %2", Стр.IDТовара, Стр.НаименованиеТовара);
				Сообщение.Сообщить();	
			
			КонецЕсли;
		
		КонецЦикла;
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Сохранение сопоставления товаров завершено";
		Сообщение.Сообщить();
		
	КонецЕсли;
	
	Возврат ТоварыКСопоставлению;

КонецФункции

#КонецОбласти 

#Область УдалениеСопоставления

Функция УдалениеСопоставления(СопоставленныеТовары, АккаунтМаркетплейса) Экспорт

	ВыбранныеСтроки = СопоставленныеТовары.НайтиСтроки(Новый Структура("ИзменитьПозицию", Истина));
	
	Если ВыбранныеСтроки.Количество() = 0 Тогда
	
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не выбрано ни одной строки для удаления сопоставления товаров";
		Сообщение.Сообщить();
		
	Иначе
			
		Для каждого Стр Из ВыбранныеСтроки Цикл 
			
			Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(АккаунтМаркетплейса, "Маркетплейс") = Перечисления.рар_мп_Маркетплейсы.Wildberries Тогда
				
				МенеджерЗаписи 			= РегистрыСведений.рар_мп_Wildberries_СопоставленныеТовары.СоздатьМенеджерЗаписи();
				МенеджерЗаписи.Аккаунт  = АккаунтМаркетплейса; 
				МенеджерЗаписи.IDТовара = Стр.IDТовара;
				МенеджерЗаписи.Артикул  = Стр.Артикул;
				МенеджерЗаписи.Баракод  = Стр.Баракод;
				
			ИначеЕсли ОбщегоНазначения.ЗначениеРеквизитаОбъекта(АккаунтМаркетплейса, "Маркетплейс") = Перечисления.рар_мп_Маркетплейсы.ЯндексМаркет  Тогда
				
				МенеджерЗаписи 			 		= РегистрыСведений.рар_мп_ЯндексМаркет_СопоставленныеТовары.СоздатьМенеджерЗаписи();
				МенеджерЗаписи.Аккаунт 	 		= АккаунтМаркетплейса; 
				МенеджерЗаписи.SKUТовара 		= Стр.SKUТовара;
				МенеджерЗаписи.SKUЯндексМаркета = Стр.SKUЯндексМаркета;
				МенеджерЗаписи.Артикул   		= Стр.Артикул;
				
			ИначеЕсли ОбщегоНазначения.ЗначениеРеквизитаОбъекта(АккаунтМаркетплейса, "Маркетплейс") = Перечисления.рар_мп_Маркетплейсы.OZON  Тогда
			
				МенеджерЗаписи 			 = РегистрыСведений.рар_мп_Ozon_СопоставленныеТовары.СоздатьМенеджерЗаписи();	
			    МенеджерЗаписи.Аккаунт   = АккаунтМаркетплейса; 
				МенеджерЗаписи.IDТовара  = Стр.IDТовара;
				МенеджерЗаписи.SKUТовара = Стр.SKUТовара;
				МенеджерЗаписи.Артикул   = Стр.Артикул;
				
			КонецЕсли; 
			
			Попытка
			
				МенеджерЗаписи.Удалить();
				
				СопоставленныеТовары.Удалить(СопоставленныеТовары.Индекс(Стр));
			
			Исключение
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = СтрШаблон("Ошибка при удалении сопоставления товара с уникальным идентификатором: %1 и названием: %2. 
											|Продробную ошибку можно посмотреть в журнале регистрации", 
											Стр.IDТовара, Стр.НаименованиеТовара);
				Сообщение.Сообщить();
				
				ЗаписьЖурналаРегистрации(СтрШаблон("Ошибка при удалении сопоставления товара с уникальным идентификатором: %1 и названием: %2", 
													Стр.IDТовара, Стр.НаименованиеТовара), УровеньЖурналаРегистрации.Ошибка,,,ОписаниеОшибки(),);
			
			КонецПопытки;
		
		КонецЦикла;
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Удаление сопоставления товаров завершено";
		Сообщение.Сообщить();
		
	КонецЕсли;	
	
	Возврат СопоставленныеТовары;

КонецФункции

#КонецОбласти

#Область СопоставлениеПоАртикулу

Функция СопоставлениеПоАртикулу(ТоварыКСопоставлению, АккаунтМаркетплейса) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Номенклатура,
		|	Номенклатура.ЕдиницаИзмерения КАК Упаковка,
		|	Номенклатура.Артикул КАК Артикул
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Артикул В (&Артикулы)";
	
	МассивАртикулов = ОбщегоНазначенияУТ.УдалитьПовторяющиесяЭлементыМассива(ТоварыКСопоставлению.ВыгрузитьКолонку("Артикул"));

	Запрос.УстановитьПараметр("Артикулы", МассивАртикулов);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выгрузить();
	
	Для каждого Строка Из ТоварыКСопоставлению Цикл
		
		Если Строка.Артикул <> "" Тогда
			
			НайденныеСтроки = ВыборкаДетальныеЗаписи.НайтиСтроки(Новый Структура("Артикул", Строка.Артикул));
		
			Если НайденныеСтроки.Количество() = 0 Тогда
			
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = СтрШаблон("Не удалось найти номенклатуру с артикулом: %1 в 1С. 
											|Необходимо выбрать номенклатуру, характеристику и упаковку вручную", Строка.Артикул);
				Сообщение.Сообщить();	
			
			ИначеЕсли НайденныеСтроки.Количество() > 1 Тогда
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = СтрШаблон("Для номенклатуры с артикулом: %1 заведено несколько номенклатур в 1С.  
											|Необходимо выбрать номенклатуру, характеристику и упаковку вручную", Строка.Артикул);
				Сообщение.Сообщить();
				
			Иначе
			
				Строка.Номенклатура = НайденныеСтроки.Получить(0).Номенклатура;
			
			КонецЕсли;
			
		Иначе
			
			Маркетплейс = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(АккаунтМаркетплейса, "Маркетплейс");
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон("Для номенклатуры с уникальным идентификатором: %1 не указан артикул.  
										|Необходимо выбрать номенклатуру, характеристику и упаковку вручную", 
										?(Маркетплейс = Перечисления.рар_мп_Маркетплейсы.ЯндексМаркет, Строка.SKUТовара, Строка.IDТовара));
			Сообщение.Сообщить();	
		
		КонецЕсли;

	КонецЦикла;
	
	Возврат ТоварыКСопоставлению;

КонецФункции

#КонецОбласти

#Область СопоставлениеПоШтрихкоду

Функция СопоставлениеПоШтрихкоду(ТоварыКСопоставлению, АккаунтМаркетплейса) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура,
		|	ШтрихкодыНоменклатуры.Упаковка КАК Упаковка,
		|	ШтрихкодыНоменклатуры.Штрихкод КАК Штрихкод
		|ИЗ
		|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
		|ГДЕ
		|	ШтрихкодыНоменклатуры.Штрихкод В(&Штрихкоды)";
	
	МассивШтрихкодов = ОбщегоНазначенияУТ.УдалитьПовторяющиесяЭлементыМассива(ТоварыКСопоставлению.ВыгрузитьКолонку("Баракод"));

	Запрос.УстановитьПараметр("Штрихкоды", МассивШтрихкодов);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выгрузить();
	
	Для каждого Строка Из ТоварыКСопоставлению Цикл
		
		Если Строка.Баракод <> "" Тогда
			
			НайденныеСтроки = ВыборкаДетальныеЗаписи.НайтиСтроки(Новый Структура("Штрихкод", Строка.Баракод));
		
			Если НайденныеСтроки.Количество() = 0 Тогда
			
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = СтрШаблон("Не удалось найти номенклатуру с баракодом: %1 в 1С. 
											|Необходимо выбрать номенклатуру, характеристику и упаковку вручную", Строка.Баракод);
				Сообщение.Сообщить();	
			
			ИначеЕсли НайденныеСтроки.Количество() > 1 Тогда
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = СтрШаблон("Для номенклатуры с баракодом: %1 заведено несколько номенклатур в 1С.  
											|Необходимо выбрать номенклатуру, характеристику и упаковку вручную", Строка.Баракод);
				Сообщение.Сообщить();
				
			Иначе
			
				Строка.Номенклатура = НайденныеСтроки.Получить(0).Номенклатура;
			
			КонецЕсли;
			
		Иначе
			
			Маркетплейс = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(АккаунтМаркетплейса, "Маркетплейс");
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон("Для номенклатуры с уникальным идентификатором: %1 не указан баракод.  
										|Необходимо выбрать номенклатуру, характеристику и упаковку вручную", 
										?(Маркетплейс = Перечисления.рар_мп_Маркетплейсы.ЯндексМаркет, Строка.SKUТовара, Строка.IDТовара));
			Сообщение.Сообщить();	
		
		КонецЕсли;

	КонецЦикла;
	
	Возврат ТоварыКСопоставлению;
	
КонецФункции

#КонецОбласти
